Revit 2027 API
RebarUpdateCurvesData.Spacing Property
 The spacing between the bars, according to the LayoutRule.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Spacing { get; }
Public ReadOnly Property Spacing As Double
	Get
public:
property double Spacing {
	double get ();
}
member Spacing : float with get
Property Value
Double
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace